plcexpert/plc-x-arduino-hardware/avr/boards.txt
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.build.mcu=ATmega328PB
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.build.f_cpu=20000000L
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.build.variant=atmega328pb
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.build.board=AVR_UNO

PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.upload.maximum_size=32256
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.upload.maximum_data_size=2048
PLCGENERICAVR.menu.module.ATMEL328PB_20MHZ.upload.speed=115200

## AT TINY85
## -------------------------------------------------
PLCGENERICAVR.menu.module.ATTINY85_8MHZ= AtTiny85 (internal 8Mhz)

PLCGENERICAVR.menu.module.ATTINY85_8MHZ.bootloader.high_fuses=0xDF
PLCGENERICAVR.menu.module.ATTINY85_8MHZ.bootloader.low_fuses=0xE2
PLCGENERICAVR.menu.module.ATTINY85_8MHZ.bootloader.extended_fuses=0xFF
PLCGENERICAVR.menu.module.ATTINY85_8MHZ.bootloader.unlock_bits=0xFF
PLCGENERICAVR.menu.module.ATTINY85_8MHZ.bootloader.lock_bits=0xFF
PLCGENERICAVR.menu.module.ATTINY85_8MHZ.bootloader.file=attiny85.hex
PLCGENERICAVR.menu.module.ATTINY85_8MHZ.bootloader.tool=arduino:avrdude

PLCGENERICAVR.menu.module.ATTINY85_8MHZ.build.core=arduino:arduino
PLCGENERICAVR.menu.module.ATTINY85_8MHZ.build.mcu=attiny85
PLCGENERICAVR.menu.module.ATTINY85_8MHZ.build.f_cpu=8000000L
PLCGENERICAVR.menu.module.ATTINY85_8MHZ.build.variant=tiny85
PLCGENERICAVR.menu.module.ATTINY85_8MHZ.build.board=attiny

PLCGENERICAVR.menu.module.ATTINY85_8MHZ.upload.maximum_size=8192
PLCGENERICAVR.menu.module.ATTINY85_8MHZ.upload.maximum_data_size=512
PLCGENERICAVR.menu.module.ATTINY85_8MHZ.upload.tool=arduino:avrdude

## AT TINY85
## -------------------------------------------------
PLCGENERICAVR.menu.module.ATTINY85_16MHZ= AtTiny85 (internal 16Mhz)

PLCGENERICAVR.menu.module.ATTINY85_16MHZ.bootloader.high_fuses=0xDF
PLCGENERICAVR.menu.module.ATTINY85_16MHZ.bootloader.low_fuses=0xF1
PLCGENERICAVR.menu.module.ATTINY85_16MHZ.bootloader.extended_fuses=0xFF
PLCGENERICAVR.menu.module.ATTINY85_16MHZ.bootloader.unlock_bits=0xFF
PLCGENERICAVR.menu.module.ATTINY85_16MHZ.bootloader.lock_bits=0xFF
PLCGENERICAVR.menu.module.ATTINY85_16MHZ.bootloader.file=attiny85.hex
PLCGENERICAVR.menu.module.ATTINY85_16MHZ.bootloader.tool=arduino:avrdude

PLCGENERICAVR.menu.module.ATTINY85_16MHZ.build.core=arduino:arduino
PLCGENERICAVR.menu.module.ATTINY85_16MHZ.build.mcu=attiny85
PLCGENERICAVR.menu.module.ATTINY85_16MHZ.build.f_cpu=16000000L
PLCGENERICAVR.menu.module.ATTINY85_16MHZ.build.variant=tiny85
PLCGENERICAVR.menu.module.ATTINY85_16MHZ.build.board=attiny

PLCGENERICAVR.menu.module.ATTINY85_16MHZ.upload.maximum_size=8192
PLCGENERICAVR.menu.module.ATTINY85_16MHZ.upload.maximum_data_size=512
PLCGENERICAVR.menu.module.ATTINY85_16MHZ.upload.tool=arduino:avrdude

## AT MEGA2560
## -------------------------------------------------
PLCGENERICAVR.menu.module.MEGA2560_16MHZ= Atmel Mega2560 (16Mhz)

PLCGENERICAVR.menu.module.MEGA2560_16MHZ.bootloader.tool=avrdude
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.bootloader.low_fuses=0xFF
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.bootloader.unlock_bits=0x3F
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.bootloader.lock_bits=0x0F
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.bootloader.high_fuses=0xD8
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.bootloader.extended_fuses=0xFD
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.bootloader.file=stk500boot_v2_mega2560.hex

PLCGENERICAVR.menu.module.MEGA2560_16MHZ.build.f_cpu=16000000L
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.build.core=arduino
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.build.variant=mega
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.build.board=AVR_MEGA2560
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.build.mcu=atmega2560

PLCGENERICAVR.menu.module.MEGA2560_16MHZ.upload.maximum_data_size=8192
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.upload.protocol=wiring
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.upload.maximum_size=253952
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.upload.speed=115200

PLCGENERICAVR.menu.module.MEGA2560_16MHZ.vid.0=0x2341
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.pid.0=0x0010
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.vid.1=0x2341
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.pid.1=0x0042
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.vid.2=0x2A03
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.pid.2=0x0010
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.vid.3=0x2A03
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.pid.3=0x0042
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.vid.4=0x2341
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.pid.4=0x0210
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.vid.5=0x2341
PLCGENERICAVR.menu.module.MEGA2560_16MHZ.pid.5=0x0242

## AT MEGA2560
## -------------------------------------------------
PLCGENERICAVR.menu.module.MEGA2560_20MHZ= Atmel Mega2560 (20Mhz)

PLCGENERICAVR.menu.module.MEGA2560_20MHZ.bootloader.tool=avrdude
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.bootloader.low_fuses=0xFF
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.bootloader.unlock_bits=0x3F
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.bootloader.lock_bits=0x0F
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.bootloader.high_fuses=0xD8
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.bootloader.extended_fuses=0xFD
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.bootloader.file=stk500boot_v2_mega2560.hex

PLCGENERICAVR.menu.module.MEGA2560_20MHZ.build.f_cpu=20000000L
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.build.core=arduino
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.build.variant=mega
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.build.board=AVR_MEGA2560
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.build.mcu=atmega2560

PLCGENERICAVR.menu.module.MEGA2560_20MHZ.upload.maximum_data_size=8192
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.upload.protocol=wiring
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.upload.maximum_size=253952
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.upload.speed=115200

PLCGENERICAVR.menu.module.MEGA2560_20MHZ.vid.0=0x2341
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.pid.0=0x0010
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.vid.1=0x2341
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.pid.1=0x0042
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.vid.2=0x2A03
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.pid.2=0x0010
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.vid.3=0x2A03
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.pid.3=0x0042
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.vid.4=0x2341
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.pid.4=0x0210
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.vid.5=0x2341
PLCGENERICAVR.menu.module.MEGA2560_20MHZ.pid.5=0x0242


