plcexpert/plc-x-arduino-hardware/avr/boards.txt
## -------------------- PRODUCTS --------------------

## DIO - Digital Input/Ouput Arduino UNO shield
## -------------------------------------------------
PLCAVR.menu.module.DIO13=PlcX-DIO 1.3 (Arduino UNO shield)

PLCAVR.menu.module.DIO13.bootloader.high_fuses=0xDE
PLCAVR.menu.module.DIO13.bootloader.low_fuses=0xFF
PLCAVR.menu.module.DIO13.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.DIO13.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.DIO13.bootloader.lock_bits=0x0F
PLCAVR.menu.module.DIO13.bootloader.file=ATmegaBOOT_168_atmega328.hex

PLCAVR.menu.module.DIO13.build.mcu=atmega328p
PLCAVR.menu.module.DIO13.build.f_cpu=16000000L
PLCAVR.menu.module.DIO13.build.variant=atmega328p
PLCAVR.menu.module.DIO13.build.board=AVR_UNO

PLCAVR.menu.module.DIO13.upload.maximum_size=32256
PLCAVR.menu.module.DIO13.upload.maximum_data_size=2048
PLCAVR.menu.module.DIO13.upload.speed=115200

## DIO - Digital Input/Ouput Arduino NANO shield 
## -------------------------------------------------
PLCAVR.menu.module.DIO14=PlcX-DIO 1.4 (Arduino NANO shield)

PLCAVR.menu.module.DIO14.bootloader.high_fuses=0xDE
PLCAVR.menu.module.DIO14.bootloader.low_fuses=0xFF
PLCAVR.menu.module.DIO14.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.DIO14.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.DIO14.bootloader.lock_bits=0x0F
PLCAVR.menu.module.DIO14.bootloader.file=ATmegaBOOT_168_atmega328.hex

PLCAVR.menu.module.DIO14.build.mcu=atmega328p
PLCAVR.menu.module.DIO14.build.f_cpu=16000000L
PLCAVR.menu.module.DIO14.build.variant=atmega328p
PLCAVR.menu.module.DIO14.build.board=AVR_UNO

PLCAVR.menu.module.DIO14.upload.maximum_size=32256
PLCAVR.menu.module.DIO14.upload.maximum_data_size=2048
PLCAVR.menu.module.DIO14.upload.speed=115200

## PlcX-Micro 1.3
## -------------------------------------------------
PLCAVR.menu.module.MICRO13=PlcX-Micro 1.3

PLCAVR.menu.module.MICRO13.bootloader.high_fuses=0xDE
PLCAVR.menu.module.MICRO13.bootloader.low_fuses=0xFF
PLCAVR.menu.module.MICRO13.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.MICRO13.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.MICRO13.bootloader.lock_bits=0x0F
PLCAVR.menu.module.MICRO13.bootloader.file=optiboot_m328pb.hex

PLCAVR.menu.module.MICRO13.build.mcu=atmega328pb
PLCAVR.menu.module.MICRO13.build.f_cpu=16000000L
PLCAVR.menu.module.MICRO13.build.variant=atmega328pb
PLCAVR.menu.module.MICRO13.build.board=AVR_UNO

PLCAVR.menu.module.MICRO13.upload.maximum_size=32256
PLCAVR.menu.module.MICRO13.upload.maximum_data_size=2048
PLCAVR.menu.module.MICRO13.upload.speed=115200

## PlcX-Nano 1.0
## -------------------------------------------------
PLCAVR.menu.module.NANO10=PlcX-Nano 1.0

PLCAVR.menu.module.NANO10.bootloader.high_fuses=0xDE
PLCAVR.menu.module.NANO10.bootloader.low_fuses=0xFF
PLCAVR.menu.module.NANO10.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.NANO10.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.NANO10.bootloader.lock_bits=0x0F
PLCAVR.menu.module.NANO10.bootloader.file=optiboot_m328pb.hex

PLCAVR.menu.module.NANO10.build.mcu=atmega328pb
PLCAVR.menu.module.NANO10.build.f_cpu=20000000L
PLCAVR.menu.module.NANO10.build.variant=atmega328pb
PLCAVR.menu.module.NANO10.build.board=AVR_UNO

PLCAVR.menu.module.NANO10.upload.maximum_size=32256
PLCAVR.menu.module.NANO10.upload.maximum_data_size=2048
PLCAVR.menu.module.NANO10.upload.speed=115200

## RFID Reader
## -------------------------------------------------
PLCAVR.menu.module.RFID= PlcX-RFID Reader 1.0

PLCAVR.menu.module.RFID.bootloader.high_fuses=0xDF
PLCAVR.menu.module.RFID.bootloader.low_fuses=0xF1
PLCAVR.menu.module.RFID.bootloader.extended_fuses=0xFF
PLCAVR.menu.module.RFID.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.RFID.bootloader.lock_bits=0xFF
PLCAVR.menu.module.RFID.bootloader.file=attiny85.hex
PLCAVR.menu.module.RFID.bootloader.tool=arduino:avrdude

PLCAVR.menu.module.RFID.build.core=arduino:arduino
PLCAVR.menu.module.RFID.build.mcu=attiny85
PLCAVR.menu.module.RFID.build.f_cpu=16000000L
PLCAVR.menu.module.RFID.build.variant=tiny85
PLCAVR.menu.module.RFID.build.board=attiny

PLCAVR.menu.module.RFID.upload.maximum_size=8192
PLCAVR.menu.module.RFID.upload.maximum_data_size=512

## UK - universal kit
## -------------------------------------------------
PLCAVR.menu.module.UK=PlcX-UK 1.4

PLCAVR.menu.module.UK.bootloader.high_fuses=0xDE
PLCAVR.menu.module.UK.bootloader.low_fuses=0xFF
PLCAVR.menu.module.UK.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.UK.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.UK.bootloader.lock_bits=0x0F
PLCAVR.menu.module.UK.bootloader.file=ATmegaBOOT_168_atmega328.hex

PLCAVR.menu.module.UK.build.mcu=atmega328p
PLCAVR.menu.module.UK.build.f_cpu=16000000L
PLCAVR.menu.module.UK.build.variant=atmega328p
PLCAVR.menu.module.UK.build.board=AVR_UNO

PLCAVR.menu.module.UK.upload.maximum_size=32256
PLCAVR.menu.module.UK.upload.maximum_data_size=2048
PLCAVR.menu.module.UK.upload.speed=115200

## --------------------------- CUSTOMER PRODUCTS ---------------------

## AccSens
## -------------------------------------------------
PLCAVR.menu.module.X_ACCSENS=X-AccSens 1.0

PLCAVR.menu.module.X_ACCSENS.bootloader.high_fuses=0xDE
PLCAVR.menu.module.X_ACCSENS.bootloader.low_fuses=0xFF
PLCAVR.menu.module.X_ACCSENS.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.X_ACCSENS.bootloader.unlock_bits=0xFF
PLCAVR.menu.module.X_ACCSENS.bootloader.lock_bits=0x0F
PLCAVR.menu.module.X_ACCSENS.bootloader.file=optiboot_m328pb.hex

PLCAVR.menu.module.X_ACCSENS.build.mcu=ATmega328PB
PLCAVR.menu.module.X_ACCSENS.build.f_cpu=16000000L
PLCAVR.menu.module.X_ACCSENS.build.variant=atmega328pb
PLCAVR.menu.module.X_ACCSENS.build.board=AVR_UNO

PLCAVR.menu.module.X_ACCSENS.upload.maximum_size=32256
PLCAVR.menu.module.X_ACCSENS.upload.maximum_data_size=2048
PLCAVR.menu.module.X_ACCSENS.upload.speed=57600

## LCD terminal 1.0
## -------------------------------------------------
PLCAVR.menu.module.X_LCDTERMINAL=X-LCD TERMINAL

PLCAVR.menu.module.X_LCDTERMINAL.bootloader.tool=avrdude
PLCAVR.menu.module.X_LCDTERMINAL.bootloader.low_fuses=0xFF
PLCAVR.menu.module.X_LCDTERMINAL.bootloader.unlock_bits=0x3F
PLCAVR.menu.module.X_LCDTERMINAL.bootloader.lock_bits=0x0F
PLCAVR.menu.module.X_LCDTERMINAL.bootloader.high_fuses=0xD8
PLCAVR.menu.module.X_LCDTERMINAL.bootloader.extended_fuses=0xFD
PLCAVR.menu.module.X_LCDTERMINAL.bootloader.file=stk500boot_v2_mega2560.hex

PLCAVR.menu.module.X_LCDTERMINAL.build.f_cpu=16000000L
PLCAVR.menu.module.X_LCDTERMINAL.build.core=arduino
PLCAVR.menu.module.X_LCDTERMINAL.build.variant=mega
PLCAVR.menu.module.X_LCDTERMINAL.build.board=AVR_MEGA2560
PLCAVR.menu.module.X_LCDTERMINAL.build.mcu=atmega2560
PLCAVR.menu.module.X_LCDTERMINAL.upload.maximum_data_size=8192
PLCAVR.menu.module.X_LCDTERMINAL.upload.protocol=wiring
PLCAVR.menu.module.X_LCDTERMINAL.upload.maximum_size=253952
PLCAVR.menu.module.X_LCDTERMINAL.upload.speed=115200

PLCAVR.menu.module.X_LCDTERMINAL.vid.0=0x2341
PLCAVR.menu.module.X_LCDTERMINAL.pid.0=0x0010
PLCAVR.menu.module.X_LCDTERMINAL.vid.1=0x2341
PLCAVR.menu.module.X_LCDTERMINAL.pid.1=0x0042
PLCAVR.menu.module.X_LCDTERMINAL.vid.2=0x2A03
PLCAVR.menu.module.X_LCDTERMINAL.pid.2=0x0010
PLCAVR.menu.module.X_LCDTERMINAL.vid.3=0x2A03
PLCAVR.menu.module.X_LCDTERMINAL.pid.3=0x0042
PLCAVR.menu.module.X_LCDTERMINAL.vid.4=0x2341
PLCAVR.menu.module.X_LCDTERMINAL.pid.4=0x0210
PLCAVR.menu.module.X_LCDTERMINAL.vid.5=0x2341
PLCAVR.menu.module.X_LCDTERMINAL.pid.5=0x0242

###################   ATMEL AVR (END)  ##############################